---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotChangeImportSymbol
source: html/0f49b99b-e706-261d-b68c-73d836b8a7a6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.CannotChangeImportSymbol Property

Can't change an imported or linked element's symbol type.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeImportSymbol { get; }
```